# Data Transformation -- 1) duplicate 값들

In [25]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [26]:
# 중복 여부 확인
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [27]:
#  아예 같은거 없앰
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [28]:
# 이건 k1 열을 기준으로 같으면 없앰
data.drop_duplicates(['k1'])

    k1  k2
0  one   1
1  two   1

In [29]:
# 이외에도 parameter들이 있음
data.drop_duplicates(['k1','k2'], keep='last')  # keep = first? last?

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

# 2) - Replace. 대체하기!

In [31]:
import numpy as np
import pandas as pd 
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [32]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [33]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [34]:
data.replace([-999,-1000], ['이렇게','하기'])

0      1
1    이렇게
2      2
3    이렇게
4     하기
5      3
dtype: object

In [36]:
# 이렇게도 가능 
data.replace({-999 : np.nan , -1000 : 0 })

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64